MikroElektronika/core_packages/PIC/XC8/def/PIC16F1713/mcu.h
extern volatile COG1FISbits_t COG1FISbits __at(0x69B);
// bitfield macros
#define _COG1FIS_G1FIS0_POSN                                0x0
#define _COG1FIS_G1FIS0_POSITION                            0x0
#define _COG1FIS_G1FIS0_SIZE                                0x1
#define _COG1FIS_G1FIS0_LENGTH                              0x1
#define _COG1FIS_G1FIS0_MASK                                0x1
#define _COG1FIS_G1FIS1_POSN                                0x1
#define _COG1FIS_G1FIS1_POSITION                            0x1
#define _COG1FIS_G1FIS1_SIZE                                0x1
#define _COG1FIS_G1FIS1_LENGTH                              0x1
#define _COG1FIS_G1FIS1_MASK                                0x2
#define _COG1FIS_G1FIS2_POSN                                0x2
#define _COG1FIS_G1FIS2_POSITION                            0x2
#define _COG1FIS_G1FIS2_SIZE                                0x1
#define _COG1FIS_G1FIS2_LENGTH                              0x1
#define _COG1FIS_G1FIS2_MASK                                0x4
#define _COG1FIS_G1FIS3_POSN                                0x3
#define _COG1FIS_G1FIS3_POSITION                            0x3
#define _COG1FIS_G1FIS3_SIZE                                0x1
#define _COG1FIS_G1FIS3_LENGTH                              0x1
#define _COG1FIS_G1FIS3_MASK                                0x8
#define _COG1FIS_G1FIS4_POSN                                0x4
#define _COG1FIS_G1FIS4_POSITION                            0x4
#define _COG1FIS_G1FIS4_SIZE                                0x1
#define _COG1FIS_G1FIS4_LENGTH                              0x1
#define _COG1FIS_G1FIS4_MASK                                0x10
#define _COG1FIS_G1FIS5_POSN                                0x5
#define _COG1FIS_G1FIS5_POSITION                            0x5
#define _COG1FIS_G1FIS5_SIZE                                0x1
#define _COG1FIS_G1FIS5_LENGTH                              0x1
#define _COG1FIS_G1FIS5_MASK                                0x20
#define _COG1FIS_G1FIS6_POSN                                0x6
#define _COG1FIS_G1FIS6_POSITION                            0x6
#define _COG1FIS_G1FIS6_SIZE                                0x1
#define _COG1FIS_G1FIS6_LENGTH                              0x1
#define _COG1FIS_G1FIS6_MASK                                0x40
#define _COG1FIS_G1FIS7_POSN                                0x7
#define _COG1FIS_G1FIS7_POSITION                            0x7
#define _COG1FIS_G1FIS7_SIZE                                0x1
#define _COG1FIS_G1FIS7_LENGTH                              0x1
#define _COG1FIS_G1FIS7_MASK                                0x80

// Register: COG1FSIM
#define COG1FSIM COG1FSIM
extern volatile unsigned char           COG1FSIM            __at(0x69C);
#ifndef _LIB_BUILD
asm("COG1FSIM equ 069Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1FSIM0                :1;
        unsigned G1FSIM1                :1;
        unsigned G1FSIM2                :1;
        unsigned G1FSIM3                :1;
        unsigned G1FSIM4                :1;
        unsigned G1FSIM5                :1;
        unsigned G1FSIM6                :1;
        unsigned G1FSIM7                :1;
    };
} COG1FSIMbits_t;
extern volatile COG1FSIMbits_t COG1FSIMbits __at(0x69C);
// bitfield macros
#define _COG1FSIM_G1FSIM0_POSN                              0x0
#define _COG1FSIM_G1FSIM0_POSITION                          0x0
#define _COG1FSIM_G1FSIM0_SIZE                              0x1
#define _COG1FSIM_G1FSIM0_LENGTH                            0x1
#define _COG1FSIM_G1FSIM0_MASK                              0x1
#define _COG1FSIM_G1FSIM1_POSN                              0x1
#define _COG1FSIM_G1FSIM1_POSITION                          0x1
#define _COG1FSIM_G1FSIM1_SIZE                              0x1
#define _COG1FSIM_G1FSIM1_LENGTH                            0x1
#define _COG1FSIM_G1FSIM1_MASK                              0x2
#define _COG1FSIM_G1FSIM2_POSN                              0x2
#define _COG1FSIM_G1FSIM2_POSITION                          0x2
#define _COG1FSIM_G1FSIM2_SIZE                              0x1
#define _COG1FSIM_G1FSIM2_LENGTH                            0x1
#define _COG1FSIM_G1FSIM2_MASK                              0x4
#define _COG1FSIM_G1FSIM3_POSN                              0x3
#define _COG1FSIM_G1FSIM3_POSITION                          0x3
#define _COG1FSIM_G1FSIM3_SIZE                              0x1
#define _COG1FSIM_G1FSIM3_LENGTH                            0x1
#define _COG1FSIM_G1FSIM3_MASK                              0x8
#define _COG1FSIM_G1FSIM4_POSN                              0x4
#define _COG1FSIM_G1FSIM4_POSITION                          0x4
#define _COG1FSIM_G1FSIM4_SIZE                              0x1
#define _COG1FSIM_G1FSIM4_LENGTH                            0x1
#define _COG1FSIM_G1FSIM4_MASK                              0x10
#define _COG1FSIM_G1FSIM5_POSN                              0x5
#define _COG1FSIM_G1FSIM5_POSITION                          0x5
#define _COG1FSIM_G1FSIM5_SIZE                              0x1
#define _COG1FSIM_G1FSIM5_LENGTH                            0x1
#define _COG1FSIM_G1FSIM5_MASK                              0x20
#define _COG1FSIM_G1FSIM6_POSN                              0x6
#define _COG1FSIM_G1FSIM6_POSITION                          0x6
#define _COG1FSIM_G1FSIM6_SIZE                              0x1
#define _COG1FSIM_G1FSIM6_LENGTH                            0x1
#define _COG1FSIM_G1FSIM6_MASK                              0x40
#define _COG1FSIM_G1FSIM7_POSN                              0x7
#define _COG1FSIM_G1FSIM7_POSITION                          0x7
#define _COG1FSIM_G1FSIM7_SIZE                              0x1
#define _COG1FSIM_G1FSIM7_LENGTH                            0x1
#define _COG1FSIM_G1FSIM7_MASK                              0x80

// Register: COG1ASD0
#define COG1ASD0 COG1ASD0
extern volatile unsigned char           COG1ASD0            __at(0x69D);
#ifndef _LIB_BUILD
asm("COG1ASD0 equ 069Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned G1ASDAC                :2;
        unsigned G1ASDBD                :2;
        unsigned G1ARSEN                :1;
        unsigned G1ASE                  :1;
    };
    struct {
        unsigned                        :2;
        unsigned G1ASDAC0               :1;
        unsigned G1ASDAC1               :1;
        unsigned G1ASDBD0               :1;
        unsigned G1ASDBD1               :1;
    };
} COG1ASD0bits_t;
extern volatile COG1ASD0bits_t COG1ASD0bits __at(0x69D);
// bitfield macros
#define _COG1ASD0_G1ASDAC_POSN                              0x2
#define _COG1ASD0_G1ASDAC_POSITION                          0x2
#define _COG1ASD0_G1ASDAC_SIZE                              0x2
#define _COG1ASD0_G1ASDAC_LENGTH                            0x2
#define _COG1ASD0_G1ASDAC_MASK                              0xC
#define _COG1ASD0_G1ASDBD_POSN                              0x4
#define _COG1ASD0_G1ASDBD_POSITION                          0x4
#define _COG1ASD0_G1ASDBD_SIZE                              0x2
#define _COG1ASD0_G1ASDBD_LENGTH                            0x2
#define _COG1ASD0_G1ASDBD_MASK                              0x30
#define _COG1ASD0_G1ARSEN_POSN                              0x6
#define _COG1ASD0_G1ARSEN_POSITION                          0x6
#define _COG1ASD0_G1ARSEN_SIZE                              0x1
#define _COG1ASD0_G1ARSEN_LENGTH                            0x1
#define _COG1ASD0_G1ARSEN_MASK                              0x40
#define _COG1ASD0_G1ASE_POSN                                0x7
#define _COG1ASD0_G1ASE_POSITION                            0x7
#define _COG1ASD0_G1ASE_SIZE                                0x1
#define _COG1ASD0_G1ASE_LENGTH                              0x1
#define _COG1ASD0_G1ASE_MASK                                0x80
#define _COG1ASD0_G1ASDAC0_POSN                             0x2
#define _COG1ASD0_G1ASDAC0_POSITION                         0x2
#define _COG1ASD0_G1ASDAC0_SIZE                             0x1
#define _COG1ASD0_G1ASDAC0_LENGTH                           0x1
#define _COG1ASD0_G1ASDAC0_MASK                             0x4
#define _COG1ASD0_G1ASDAC1_POSN                             0x3
#define _COG1ASD0_G1ASDAC1_POSITION                         0x3
#define _COG1ASD0_G1ASDAC1_SIZE                             0x1
#define _COG1ASD0_G1ASDAC1_LENGTH                           0x1
#define _COG1ASD0_G1ASDAC1_MASK                             0x8
#define _COG1ASD0_G1ASDBD0_POSN                             0x4
#define _COG1ASD0_G1ASDBD0_POSITION                         0x4
#define _COG1ASD0_G1ASDBD0_SIZE                             0x1
#define _COG1ASD0_G1ASDBD0_LENGTH                           0x1
#define _COG1ASD0_G1ASDBD0_MASK                             0x10
#define _COG1ASD0_G1ASDBD1_POSN                             0x5
#define _COG1ASD0_G1ASDBD1_POSITION                         0x5
#define _COG1ASD0_G1ASDBD1_SIZE                             0x1
#define _COG1ASD0_G1ASDBD1_LENGTH                           0x1
#define _COG1ASD0_G1ASDBD1_MASK                             0x20

// Register: COG1ASD1
#define COG1ASD1 COG1ASD1
extern volatile unsigned char           COG1ASD1            __at(0x69E);
#ifndef _LIB_BUILD
asm("COG1ASD1 equ 069Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1AS0E                 :1;
        unsigned G1AS1E                 :1;
        unsigned G1AS2E                 :1;
        unsigned G1AS3E                 :1;
    };
} COG1ASD1bits_t;
